In [62]:
import pandas as pd
from pathlib import Path
import math

In [63]:
dir_to_pricelist = '/Users/Delphine/Desktop/work/Price Lists'
p_pricelist = Path(dir_to_pricelist)

pricelist = pd.read_csv(p_pricelist/'All Suppliers Price List.csv')
pricelist = pricelist.drop(['Unnamed: 0'], axis=1)
pricelist.astype({'Item No.':'str'}).dtypes
pricelist.head()

,Item No.,Description,Range,MOQ,Tier 1 Price,Tier 2 Qty,Tier 2 Price,Tier 3 Qty,Tier 3 Price,Unit,Supplier
0,16051,COFFEE SPOON-18/10 JEWEL,NaN,12,$ 0.91,NaN,NaN,NaN,NaN,NaN,Trenton WA
1,16052,DESSERT FORK-18/10 JEWEL,NaN,12,$ 1.73,NaN,NaN,NaN,NaN,NaN,Trenton WA
2,16053,DESSERT SPOON-18/10 JEWEL,NaN,12,$ 1.73,NaN,NaN,NaN,NaN,NaN,Trenton WA
3,16054,SOUP SPOON-18/10 JEWEL,NaN,12,$ 1.73,NaN,NaN,NaN,NaN,NaN,Trenton WA
4,16055,TEASPOON-18/10 JEWEL,NaN,12,$ 1.06,NaN,NaN,NaN,NaN,NaN,Trenton WA

In [64]:
content = ['EVE10501.TK x 3', 'CC528748 x 1', '17060 x 48', '69890.TK x 2', 'CC528748 x 1', 'CC140007 x 36']
print(content)

['EVE10501.TK x 3', 'CC528748 x 1', '17060 x 48', '69890.TK x 2', 'CC528748 x 1', 'CC140007 x 36']

In [67]:
def order_to_pd():
    df = pd.DataFrame(content, columns = ['ordering'])
    df = df.join(
            df.ordering.str.rsplit(n=2 , expand=True).rename(
                columns={0: 'Sku', 1: 'times', 2: 'Quantity'}
            )
        )
    df = df.drop(['ordering', 'times'], axis = 1)
    df= df.dropna(axis=0)
    df = df.astype({"Quantity": int})
    df = df.groupby(by='Sku', as_index = False ).sum()
    
    return df

orders = order_to_pd()
print(orders)

           Sku  Quantity
0        17060        48
1     69890.TK         2
2     CC140007        36
3     CC528748         2
4  EVE10501.TK         3

In [68]:
def moq():
    df = order_to_pd()
    
    for i in range (0, len(df.index)):
        #try:
        price_list_line = pricelist.loc[pricelist['Item No.'] == df['Sku'][i]]
        item = pricelist.loc[price_list_line.index]
        #index_item = item.index[0]
        qty_needed = int(df['Quantity'][i])

        #except:
            # The product code isn't on the price list, order the quantity originally ordered
         #   sku_qty.at[i, 'To Order'] = qty_needed

        #continue

        # Dealing with the cutlery having to be ordered in dozens only

        if ((price_list_line['Unit']  == 'Doz').all() | (price_list_line['Unit']  == 'DOZ').all()):

            to_order = math.ceil(qty_needed / 12)
            df.at[i, 'To Order'] = to_order


        else : 

        # The product code is on the price list, make the calculations based on MOQ
        # Most of products will follow this

            moq = int(item['MOQ'][item.index[0]]) 
            to_order = math.ceil(qty_needed / moq) * moq
            df.at[i, 'To Order'] = to_order
       
        
    return df

In [70]:
orders = moq()
orders

           Sku  Quantity  To Order
0        17060        48       4.0
1     69890.TK         2       2.0
2     CC140007        36      48.0
3     CC528748         2       2.0
4  EVE10501.TK         3       3.0

In [74]:
def get_order_toplace():
    
    df = moq()
    codes_list = []
    i=0

    def convertTuple(tup):
        str =  ''.join(tup)
        return str

    for i in df.index:
        code_plus_quantities = df['Sku'][i], ' x ' , str(int(df['To Order'][i]))
        code_plus_quantities = convertTuple(code_plus_quantities)
        codes_list.append(code_plus_quantities)
        i+1

    return codes_list

In [75]:
codes_list = get_order_toplace()
codes_list

['17060 x 4',
 '69890.TK x 2',
 'CC140007 x 48',
 'CC528748 x 2',
 'EVE10501.TK x 3']